## 7.1 處理遺失資料

In [6]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aar', 'bbk', np.nan, 'ccd'])
string_data

0    aar
1    bbk
2    NaN
3    ccd
dtype: object

In [8]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data[0] = None

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
from numpy import nan as NA

In [15]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned = data.dropna()

In [21]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [23]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [27]:
data[1][0]

6.5

In [28]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.533495 -1.510041  1.518052
1 -0.054363 -0.821418  0.069423
2 -0.656389 -1.050533  0.441390
3  1.474297  0.561816 -0.245285
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

In [30]:
df[2]    # 選擇一個 "欄 columns"

0    1.518052
1    0.069423
2    0.441390
3   -0.245285
4    0.562423
5   -0.084556
6   -0.650115
Name: 2, dtype: float64

In [31]:
df[:2]   # 做切片：選擇指定的 "列 row"

          0         1         2
0  0.533495 -1.510041  1.518052
1 -0.054363 -0.821418  0.069423

In [32]:
df.iloc[:4, 1] = NA

In [33]:
df

          0         1         2
0  0.533495       NaN  1.518052
1 -0.054363       NaN  0.069423
2 -0.656389       NaN  0.441390
3  1.474297       NaN -0.245285
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

In [34]:
df.iloc[:2, 2] = NA

In [35]:
df

          0         1         2
0  0.533495       NaN       NaN
1 -0.054363       NaN       NaN
2 -0.656389       NaN  0.441390
3  1.474297       NaN -0.245285
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

In [36]:
df.dropna()

          0         1         2
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

In [38]:
df.dropna(thresh = 2)

          0         1         2
2 -0.656389       NaN  0.441390
3  1.474297       NaN -0.245285
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

In [39]:
df

          0         1         2
0  0.533495       NaN       NaN
1 -0.054363       NaN       NaN
2 -0.656389       NaN  0.441390
3  1.474297       NaN -0.245285
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

In [40]:
df.fillna(0)

          0         1         2
0  0.533495  0.000000  0.000000
1 -0.054363  0.000000  0.000000
2 -0.656389  0.000000  0.441390
3  1.474297  0.000000 -0.245285
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

In [43]:
_ = df.fillna(0, inplace=True)

In [44]:
df

          0         1         2
0  0.533495  0.000000  0.000000
1 -0.054363  0.000000  0.000000
2 -0.656389  0.000000  0.441390
3  1.474297  0.000000 -0.245285
4  2.006942 -0.575290  0.562423
5  1.356313  0.395151 -0.084556
6  0.835857  0.014907 -0.650115

---
## 7.2 資料轉換
### 移除重複值

In [45]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1'] = range(7)   # 未有該欄, 直接加上
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [50]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

### 使用函式或對應關係轉換值

In [51]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
                              'Pastrami', 'corned beef', 'Bacon', 
                              'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
mean_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [54]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [58]:
data['animal'] = lowercased.map(mean_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: mean_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [60]:
data['food']

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [1]:
import pandas as pd
import numpy as np

### 更名軸index

In [2]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [3]:
transform = lambda x: x[:4].upper()

In [4]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [5]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [6]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [7]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [8]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [11]:
data.rename(index={'OHIO': 'INDEANA'},
           columns={'three': 'peekaboo'},
           inplace=True)

In [12]:
data

         one  two  peekaboo  four
INDEANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### 離散化和分組

In [17]:
'''
cut
'''
ages = [20,22,25,27,21,23,37,31,61,45,41,32, 101]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)  # 默認 right=True: 包含右邊
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (60, 100], (35, 60], (35, 60], (25, 35], NaN]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [19]:
cats.codes  # 原labels已棄用

array([ 0,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1, -1], dtype=int8)

In [20]:
cats.categories  # 原levels已棄用

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [21]:
pd.value_counts(cats)  # 分組以後每組數量

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [22]:
group_name = ['Youth', 'YoughAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_name)

[Youth, Youth, Youth, YoughAdult, Youth, ..., Senior, MiddleAged, MiddleAged, YoughAdult, NaN]
Length: 13
Categories (4, object): [Youth < YoughAdult < MiddleAged < Senior]

In [31]:
data = np.random.rand(20)  # rand:的隨機樣本位於[0, 1)中 ; randn:從標準正態分布中返回一或多個樣本值
data

array([0.09650283, 0.69274724, 0.30107633, 0.88566348, 0.71892408,
       0.08657114, 0.97323794, 0.273755  , 0.51079411, 0.64393863,
       0.44064793, 0.31824659, 0.27480578, 0.63160079, 0.25732781,
       0.85269862, 0.63915492, 0.9153267 , 0.89669674, 0.84489732])

In [32]:
pd.cut(data, 4, precision=2)  # bins=4, precision=2 限定小數點下兩位

[(0.086, 0.31], (0.53, 0.75], (0.086, 0.31], (0.75, 0.97], (0.53, 0.75], ..., (0.75, 0.97], (0.53, 0.75], (0.75, 0.97], (0.75, 0.97], (0.75, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.086, 0.31] < (0.31, 0.53] < (0.53, 0.75] < (0.75, 0.97]]

In [36]:
'''
qcut
'''
data = np.random.randn(1000) # 常態分布
cats = pd.qcut(data, 4) # 切成四分，同[0, .25, .5, .75, 1]
cats

[(-0.675, 0.0541], (0.728, 3.194], (-3.79, -0.675], (-3.79, -0.675], (0.0541, 0.728], ..., (0.0541, 0.728], (0.728, 3.194], (0.0541, 0.728], (0.728, 3.194], (-0.675, 0.0541]]
Length: 1000
Categories (4, interval[float64]): [(-3.79, -0.675] < (-0.675, 0.0541] < (0.0541, 0.728] < (0.728, 3.194]]

In [37]:
pd.value_counts(cats)

(0.728, 3.194]      250
(0.0541, 0.728]     250
(-0.675, 0.0541]    250
(-3.79, -0.675]     250
dtype: int64

In [39]:
cats2 = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])  # 自訂每組的數量，範圍0~1(包含1)
cats2

[(-1.274, 0.0541], (0.0541, 1.313], (-3.79, -1.274], (-1.274, 0.0541], (0.0541, 1.313], ..., (0.0541, 1.313], (1.313, 3.194], (0.0541, 1.313], (0.0541, 1.313], (-1.274, 0.0541]]
Length: 1000
Categories (4, interval[float64]): [(-3.79, -1.274] < (-1.274, 0.0541] < (0.0541, 1.313] < (1.313, 3.194]]

In [40]:
pd.value_counts(cats2)

(0.0541, 1.313]     400
(-1.274, 0.0541]    400
(1.313, 3.194]      100
(-3.79, -1.274]     100
dtype: int64

### 偵測和濾除離群值

In [45]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [50]:
data.head()

          0         1         2         3
0  0.033794 -0.664355  0.520691 -0.821900
1  0.348625  2.265377  0.494231 -0.016097
2  0.737032 -0.518984  0.059168 -1.633019
3 -0.629101  0.695014  1.305118 -0.111386
4 -0.876626 -0.104553 -0.136452 -1.680147

In [47]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034991    -0.032935    -0.029728     0.069927
std       0.967370     0.973995     0.996669     0.974779
min      -3.174577    -3.533107    -3.305268    -3.672466
25%      -0.602754    -0.688148    -0.695574    -0.598164
50%       0.034418    -0.055922    -0.049259     0.086167
75%       0.680312     0.628569     0.619664     0.702600
max       2.763957     3.164794     3.405522     3.351440

In [48]:
col = data[2]
col[np.abs(col) > 3]  # 絕對值大於 3

595    3.366828
726   -3.050819
871    3.405522
941   -3.305268
Name: 2, dtype: float64

In [51]:
data[(np.abs(data) > 3).any(1)]  # 布林DataFrame的any方法, 查看所有欄

            0         1         2         3
16   0.062822 -0.020053  1.545564  3.349804
65   0.831973  3.164794 -0.698613 -0.996470
148 -0.723589 -0.713244  1.113991 -3.672466
159 -0.404739 -3.533107 -0.532249  0.910838
421 -3.174577 -1.142662  1.295821 -0.367463
595 -0.204557 -1.573877  3.366828 -0.723677
669  1.743825 -3.131349 -0.560451 -1.242011
726 -0.593831  0.342675 -3.050819 -0.855458
780  0.929558  3.135332  0.597000  0.042038
858  0.534200 -0.838749  0.361994  3.351440
871 -2.255438  1.179905  3.405522 -0.244641
941 -2.957577 -0.384988 -3.305268 -0.055995

In [52]:
data[np.abs(data) > 3] = np.sign(data) * 3  # 給值, 把值保持在 (-3, 3) 之間

In [53]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.035165    -0.032570    -0.030144     0.069898
std       0.966806     0.970850     0.993051     0.970180
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.602754    -0.688148    -0.695574    -0.598164
50%       0.034418    -0.055922    -0.049259     0.086167
75%       0.680312     0.628569     0.619664     0.702600
max       2.763957     3.000000     3.000000     3.000000

In [54]:
np.sign(data).head()  # 值為正數=1, 值為負數=-1

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0 -1.0
2  1.0 -1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

### 排列與隨機抽樣

In [61]:
df = pd.DataFrame(np.arange(20).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([3, 4, 2, 1, 0])

In [62]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [63]:
df.take(sampler)   # take:將陣列用於iloc基礎索引

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [64]:
# 不重複子集
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [65]:
# 可重複子集, replace=True
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
1    7
2   -1
3    6
3    6
3    6
3    6
3    6
2   -1
1    7
dtype: int64

### 指標/虛擬變數

In [66]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [67]:
pd.get_dummies(df['key'])  #有 k 欄,內容為 0 或 1 的 DataFrame

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [70]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [71]:
df_with_dummy = df[['data1']].join(dummies)  # 為指標DataFrame的欄位加上前綴
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [72]:
# 來源: GroupLens Reasearch (https://grouplens.org/datasets/movielens/)
mnames = ['movie_id', 'title', 'genres']

In [73]:
movies = pd.read_table('movies.dat', sep='::', header=None, names=mnames)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [75]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

---
## 7.3 字串操作